; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	image2 - mode
	spectrograph1 - mode
	thermograph0 - mode
	thermograph3 - mode
	GroundStation2 - direction
	GroundStation5 - direction
	Star0 - direction
	Star3 - direction
	Star1 - direction
	GroundStation4 - direction
	Star6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument2 image2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph1)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 image2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 thermograph3)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument7 image2)
	(supports instrument7 thermograph3)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet10)
	(supports instrument8 thermograph3)
	(calibration_target instrument8 Star1)
	(supports instrument9 spectrograph1)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
	(supports instrument10 thermograph0)
	(supports instrument10 image2)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation4)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation4)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(pointing satellite1 Planet8)
	(pointing satellite2 Star0)
	(pointing satellite4 Planet10)
	(pointing satellite5 Star1)
	(have_image Star6 thermograph3)
	(have_image Phenomenon7 thermograph0)
	(have_image Planet8 image2)
	(have_image Planet9 thermograph0)
	(have_image Planet10 thermograph3)
	(have_image Star11 spectrograph1)
))

)

; plan
1. (turn_to satellite4 groundstation4 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 groundstation4)
   goals met: 1 of 11
2. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 1 of 11
3. (calibrate satellite4 instrument9 groundstation4)
   added: (calibrated instrument9)
   goals met: 1 of 11
4. (turn_to satellite4 planet9 groundstation4)
   deleted: (pointing satellite4 groundstation4)
   added: (pointing satellite4 planet9)
   goals met: 1 of 11
5. (take_image satellite4 planet9 instrument9 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 2 of 11
6. (turn_to satellite4 phenomenon7 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 phenomenon7)
   goals met: 2 of 11
7. (turn_to satellite2 star0 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star0)
   goals met: 3 of 11
8. (turn_to satellite1 star1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star1)
   goals met: 3 of 11
9. (take_image satellite4 phenomenon7 instrument9 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 4 of 11
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 11
11. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 4 of 11
12. (turn_to satellite1 planet8 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet8)
   goals met: 5 of 11
13. (take_image satellite1 planet8 instrument2 image2)
   added: (have_image planet8 image2)
   goals met: 6 of 11
14. (turn_to satellite4 star11 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 star11)
   goals met: 6 of 11
15. (take_image satellite4 star11 instrument9 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 7 of 11
16. (turn_to satellite4 star6 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star6)
   goals met: 7 of 11
17. (take_image satellite4 star6 instrument9 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 8 of 11
18. (turn_to satellite4 planet10 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 planet10)
   goals met: 9 of 11
19. (take_image satellite4 planet10 instrument9 thermograph3)
   added: (have_image planet10 thermograph3)
   goals met: 10 of 11
20. (turn_to satellite5 star1 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 star1)
   goals met: 11 of 11
